ihorkrav/DistanceMeter/Distance meter/Core/Inc/CANFD_STM32G431.h
	// Проверка допустимости значений tseg1 и tseg2
	if (tseg1
			< 1|| tseg1 > NOMINAL_TIME_SEG1_MAX || tseg2 < 1 || tseg2 > NOMINAL_TIME_SEG2_MAX) {
		// Ошибка: Значения временных сегментов tseg1 или tseg2 выходят за допустимые пределы.
		return 0;
	}

	// Проверка допустимости отклонения частоты передачи данных
	tfq_real = tq_per_bit * config->nominal_rate_bps;
	freq_diff = (ftq - tfq_real) * 2 * 100 / (ftq + tfq_real);

	if (fabs(freq_diff) > config->baud_rate_tolerance) {
		// Ошибка: Отклонение частоты передачи данных превышает допустимое значение.
		return 0;
	}

	// Формирование значения регистра FDCAN_NBTP
	uint32_t FDCAN_NBTP = ((config->prescaler - 1) << FDCAN_NBTP_NBRP_Pos)
			& FDCAN_NBTP_NBRP_Msk;
	FDCAN_NBTP |=
			((tseg1 - 1) << FDCAN_NBTP_NTSEG1_Pos) & FDCAN_NBTP_NTSEG1_Msk;
	FDCAN_NBTP |=
			((tseg2 - 1) << FDCAN_NBTP_NTSEG2_Pos) & FDCAN_NBTP_NTSEG2_Msk;
	FDCAN_NBTP |= (((config->nsjw ? config->nsjw : 1) - 1)
			<< FDCAN_NBTP_NSJW_Pos) & FDCAN_NBTP_NSJW_Msk;

	return FDCAN_NBTP;
}

void FDCAN_Config(FDCAN_BaudRate *config) {

	// Включение тактирования для FDCAN и GPIO
	RCC->APB1ENR1 |= RCC_APB1ENR1_FDCANEN;

	// Выключаем FDCAN перед настройкой
	FDCAN->CCCR |= FDCAN_CCCR_INIT;

	while (!(FDCAN->CCCR & FDCAN_CCCR_INIT))
		;

	// Разрешаем доступ к конфигурационным регистрам
	FDCAN->CCCR |= FDCAN_CCCR_CCE;

	// Установка скорости передачи данных
	FDCAN_SetBaudRate(config);

	// Завершение настройки

	FDCAN->CCCR &= ~FDCAN_CCCR_INIT;
	while (FDCAN->CCCR & FDCAN_CCCR_INIT)
		;

	//   NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
	// NVIC_EnableIRQ(FDCAN1_IT1_IRQn);

}

/*
 Регистры включения прерываний FDCAN (FDCAN_IE)
 Настройки в регистре включения прерываний определяют, какие изменения статуса в регистре прерываний сигнализируются по линии прерывания.

 Смещение адреса: 0x0054
 Начальное значение: 0x0000 0000
 Биты регистра
 Биты 31:24: Зарезервировано, должно сохраняться на начальном значении.
 Бит 23 (ARAE): Разрешение доступа к зарезервированному адресу.
 Бит 22 (PEDE): Разрешение прерывания при ошибке протокола в фазе данных.
 Бит 21 (PEAE): Разрешение прерывания при ошибке протокола в фазе арбитрации.
 Бит 20 (WDIE): Разрешение прерывания таймера watchdog.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 19 (BOE): Статус Bus-off.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 18 (EWE): Разрешение прерывания статуса предупреждения.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 17 (EPE): Разрешение прерывания в режиме "ошибка пассивная".
 0: Прерывание отключено
 1: Прерывание включено
 Бит 16 (ELOE): Разрешение прерывания переполнения журналирования ошибок.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 15 (TOOE): Разрешение прерывания при возникновении таймаута.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 14 (MRAFE): Разрешение прерывания при сбое доступа к RAM сообщениям.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 13 (TSWE): Разрешение прерывания при переполнении временной метки.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 12 (TEFLE): Разрешение прерывания при потере элемента в FIFO событий Tx.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 11 (TEFFE): Разрешение прерывания при переполнении FIFO событий Tx.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 10 (TEFNE): Разрешение прерывания при новом элементе в FIFO событий Tx.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 9 (TFEE): Разрешение прерывания при пустом FIFO Tx.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 8 (TCFE): Разрешение прерывания при завершении отмены передачи.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 7 (TCE): Разрешение прерывания при завершении передачи.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 6 (HPME): Разрешение прерывания для сообщений с высоким приоритетом.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 5 (RF1LE): Разрешение прерывания при потере сообщения в FIFO 1 приема.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 4 (RF1FE): Разрешение прерывания при переполнении FIFO 1 приема.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 3 (RF1NE): Разрешение прерывания при новом сообщении в FIFO 1 приема.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 2 (RF0LE): Разрешение прерывания при потере сообщения в FIFO 0 приема.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 1 (RF0FE): Разрешение прерывания при переполнении FIFO 0 приема.
 0: Прерывание отключено
 1: Прерывание включено
 Бит 0 (RF0NE): Разрешение прерывания при новом сообщении в FIFO 0 приема.
 0: Прерывание отключено
 1: Прерывание включено
 */
/*
 Регистры прерываний FDCAN (FDCAN_IR)
 Флаги устанавливаются, когда обнаруживаются одни из перечисленных условий (чувствительность к фронту). Флаги остаются установленными до тех пор, пока хост не сбросит их. Флаг сбрасывается записью 1 в соответствующую позицию бита. Запись 0 не имеет эффекта. Жесткий сброс очищает регистр. Конфигурация FDCAN_IE управляет тем, генерируется ли прерывание. Конфигурация FDCAN_ILS управляет тем, на какой линии прерывания сигнализируется прерывание.

 Смещение адреса: 0x0050
 Начальное значение: 0x0000 0000
 Биты регистра
 Биты 31:24: Зарезервировано, должно сохраняться на начальном значении.
 Бит 23 (ARA): Доступ к зарезервированному адресу.
 0: Доступ к зарезервированному адресу не произошел.
 1: Произошел доступ к зарезервированному адресу.
 Бит 22 (PED): Ошибка протокола в фазе данных (используется время бита данных).
 0: Ошибки протокола в фазе данных нет.
 1: Обнаружена ошибка протокола в фазе данных.
 Бит 21 (PEA): Ошибка протокола в фазе арбитрации (используется номинальное время бита).
 0: Ошибки протокола в фазе арбитрации нет.
 1: Обнаружена ошибка протокола в фазе арбитрации.
 Бит 20 (WDI): Прерывание таймера watchdog.
 0: Событие watchdog сообщения RAM не произошло.
 1: Произошло событие watchdog сообщения RAM из-за отсутствия READY.
 Бит 19 (BO): Статус Bus-off.
 0: Статус Bus-off не изменился.
 1: Статус Bus-off изменен.
 Бит 18 (EW): Статус предупреждения.
 0: Статус предупреждения об ошибке не изменился.
 1: Статус предупреждения об ошибке изменен.
 Бит 17 (EP): Ошибка в пассивном режиме.
 0: Статус ошибки в пассивном режиме не изменился.
 1: Статус ошибки в пассивном режиме изменен.
 Бит 16 (ELO): Переполнение журнала ошибок.
 0: Счетчик журналирования ошибок CAN не переполнился.
 1: Произошло переполнение счетчика журналирования ошибок CAN.
 Бит 15 (TOO): Произошел таймаут.
 0: Таймаут не произошел.
 1: Таймаут достигнут.
 Бит 14 (MRAF): Ошибка доступа к RAM сообщений.
 Флаг устанавливается, когда обработчик Rx:
 Не завершил фильтрацию или хранение принятого сообщения до получения поля арбитрации следующего сообщения.
 Не смог записать сообщение в RAM сообщений.
 0: Ошибки доступа к RAM сообщений не произошло.
 1: Произошла ошибка доступа к RAM сообщений.
 Бит 13 (TSW): Переполнение временной метки.
 0: Переполнения счетчика временной метки не произошло.
 1: Счетчик временной метки переполнился.
 Бит 12 (TEFL): Потеря элемента FIFO событий Tx.
 0: Элементы FIFO событий Tx не потеряны.
 1: Элемент FIFO событий Tx потерян.
 Бит 11 (TEFF): FIFO событий Tx полон.
 0: FIFO событий Tx не полон.
 1: FIFO событий Tx полон.
 Бит 10 (TEFN): Новый элемент в FIFO событий Tx.
 0: FIFO событий Tx не изменен.
 1: Обработчик Tx записал элемент в FIFO событий Tx.
 Бит 9 (TFE): FIFO Tx пуст.
 0: FIFO Tx не пуст.
 1: FIFO Tx пуст.
 Бит 8 (TCF): Завершение отмены передачи.
 0: Завершения отмены передачи не произошло.
 1: Завершение отмены передачи произошло.
 Бит 7 (TC): Завершение передачи.
 0: Передача не завершена.
 1: Передача завершена.
 Бит 6 (HPM): Получено сообщение с высоким приоритетом.
 0: Сообщение с высоким приоритетом не получено.
 1: Сообщение с высоким приоритетом получено.
 Бит 5 (RF1L): Потеря сообщения в FIFO 1 приема.
 0: Сообщение в FIFO 1 приема не потеряно.
 1: Сообщение в FIFO 1 приема потеряно.
 Бит 4 (RF1F): FIFO 1 приема полон.
 0: FIFO 1 приема не полон.
 1: FIFO 1 приема полон.
 Бит 3 (RF1N): Новое сообщение в FIFO 1 приема.
 0: Новое сообщение не записано в FIFO 1 приема.
 1: Новое сообщение записано в FIFO 1 приема.
 Бит 2 (RF0L): Потеря сообщения в FIFO 0 приема.
 0: Сообщение в FIFO 0 приема не потеряно.
 1: Сообщение в FIFO 0 приема потеряно.
 Бит 1 (RF0F): FIFO 0 приема полон.
 0: FIFO 0 приема не полон.
 1: FIFO 0 приема полон.
 Бит 0 (RF0N): Новое сообщение в FIFO 0 приема.
 0: Новое сообщение не записано в FIFO 0 приема.
 1: Новое сообщение записано в FIFO 0 приема.
 */

///




void CAN_Config2(void) {
    // Настройка CAN
    FDCAN_GlobalTypeDef *CAN = FDCAN1;
    uint32_t *filterRAM = (uint32_t*) RAMBaseFDCAN1;

    // Выбор битрейта (в кбит/с)
    uint32_t baudrate = 1000; // Можно изменить на 100, 125, 250, 500, 800, 1000

    // Включение тактирования для CAN
    RCC->APB1ENR1 |= RCC_APB1ENR1_FDCANEN;

    RCC->CCIPR &= ~RCC_CCIPR_FDCANSEL;
    // Установить PLL "Q" как источник тактирования для FDCAN
    RCC->CCIPR |= (0x1 << RCC_CCIPR_FDCANSEL_Pos); // Установить PLL "Q"

    // Выключаем CAN перед настройкой
    CAN->CCCR |= FDCAN_CCCR_INIT;
    while (!(CAN->CCCR & FDCAN_CCCR_INIT))
        ;

