ihorkrav/DistanceMeter/Distance meter/Core/Inc/CANFD_STM32G431.h
    // Разрешение доступа к конфигурационным регистрам
    CAN->CCCR |= FDCAN_CCCR_CCE;

    /*
     Baudrate   NSJW   NBRP   NTSEG1   NTSEG2   FDCAN_NBTP (uint32)
     100000     3(2)   39     15(14)   4(3)     0x018270E
     125000     3(2)   31     15(14)   4(3)     0x0181F0E
     250000     3(2)   15     15(14)   4(3)     0x0180F0E
     500000     3(2)   7      15(14)   4(3)     0x018070E
     800000     3(2)   4      15(14)   4(3)     0x018040E
     1000000    3(2)   3      15(14)   4(3)     0x018030E
    */

    // Set the nominal bit timing register
    switch (baudrate) {
        case 100:
            CAN->NBTP = (2 << FDCAN_NBTP_NSJW_Pos) | (39 << FDCAN_NBTP_NBRP_Pos) |
                        (14 << FDCAN_NBTP_NTSEG1_Pos) | (3 << FDCAN_NBTP_NTSEG2_Pos);
            break;
        case 125:
            CAN->NBTP = (2 << FDCAN_NBTP_NSJW_Pos) | (31 << FDCAN_NBTP_NBRP_Pos) |
                        (14 << FDCAN_NBTP_NTSEG1_Pos) | (3 << FDCAN_NBTP_NTSEG2_Pos);
            break;
        case 250:
            CAN->NBTP = (2 << FDCAN_NBTP_NSJW_Pos) | (15 << FDCAN_NBTP_NBRP_Pos) |
                        (14 << FDCAN_NBTP_NTSEG1_Pos) | (3 << FDCAN_NBTP_NTSEG2_Pos);
            break;
        case 500:
            CAN->NBTP = (2 << FDCAN_NBTP_NSJW_Pos) | (7 << FDCAN_NBTP_NBRP_Pos) |
                        (14 << FDCAN_NBTP_NTSEG1_Pos) | (3 << FDCAN_NBTP_NTSEG2_Pos);
            break;
        case 800:
            CAN->NBTP = (2 << FDCAN_NBTP_NSJW_Pos) | (4 << FDCAN_NBTP_NBRP_Pos) |
                        (14 << FDCAN_NBTP_NTSEG1_Pos) | (3 << FDCAN_NBTP_NTSEG2_Pos);
            break;
        case 1000:
            CAN->NBTP = (2 << FDCAN_NBTP_NSJW_Pos) | (3 << FDCAN_NBTP_NBRP_Pos) |
                        (14 << FDCAN_NBTP_NTSEG1_Pos) | (3 << FDCAN_NBTP_NTSEG2_Pos);
            break;
        default:
            // По умолчанию 500 кбит/с
            CAN->NBTP = (2 << FDCAN_NBTP_NSJW_Pos) | (7 << FDCAN_NBTP_NBRP_Pos) |
                        (14 << FDCAN_NBTP_NTSEG1_Pos) | (3 << FDCAN_NBTP_NTSEG2_Pos);
            break;
    }

    // Clear message RAM
    for (uint8_t i = 0; i < 212; i++) {
        filterRAM[i] = 0;
    }

    // Настройка глобального фильтра
    CAN->RXGFC = STDfilter_n(2) | EXTfilter_n(0) | ANFS_Reject_rx | ANFE_Reject_rx;

    // ID фильтры 100 и 80
    filterRAM[0] = STDfilterID_DUAL | STDfilterRxFIFO0 | STDfilterID1(100) | STDfilterID2(80);

    // Включить прерывания в FDCAN FIFO
    CAN->IE |= 3; // FDCAN_IE_RF0NE | FDCAN_IE_RF0FE
    CAN->ILS |= 1; // RXFIFO0: RX FIFO bit grouping
    CAN->ILE |= 2; // Enable IT1

    // Включение SYSCFG
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    // Включение прерывания
    NVIC_EnableIRQ(FDCAN1_IT1_IRQn);

    // Настройка режима работы (нормальный режим)
    CAN->CCCR &= ~FDCAN_CCCR_INIT;
    while (CAN->CCCR & FDCAN_CCCR_INIT)
        ;
}



#endif /* INC_CANFD_STM32G431_H_ */
